app/controllers/students_controller.rb

  def create
    @student = Student.create(post_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-01-24 06:54:11.172280"], ["updated_at", "2018-01-24 06:54:11.172280"]]